関数
・htmlspecialchars...悪意のあるコードが実行されないように、特殊文字に変換してくれる。
htmlspecialchars(返還対象,　変換パターン, 文字コード)で使う。

vim
・インサートモードにするにはiを押下
・インサートモードを解除するには左上のescボタンを押下
・:wエンターで保存
・:qエンターで脱出
・HJKLで移動
・ビジュアルモードは(v)を押下。指定した範囲をコピーできる。
・:wの後にスペース空けて新しいファイル名を書いてエンターで、新しいファイル名で保存してくれる。
・:qの後に!を付けてエンターすると、変更点を無視して強制的に終了することができる。
・:eの後にスペース空けて開きたいファイル名を書いてエンターで、別のファイルを開くことができる。
・ノーマルモードでgg押下で一番上に行く。Gで一番下に行く。
・ノーマルモードで、ctrl+fで一画面下に行く。ctrl+bで一画面上に行く。
・ノーマルモードで、w押下で一単語ずつ前に行く。b押下で一単語ずつ後ろに行く。
・^押下で行頭へ、$押下で行末へ行く。
・f+その行で行きたいアルファベット押下でその文字まで移動してくれる。
・{}の上で%押下で、該当する{}まで連れて行ってくれる。
・v押下で単語単位でのビジュアルモード。V押下で行単位でのビジュアルモード。ctrl+vで矩形単位でのビジュアルモード。
・
